In [9]:
# Import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from datasets import load_dataset

In [3]:
# Loading data
load_dataset('lukebarousse/data_jobs')

Downloading readme: 100%|██████████| 28.0/28.0 [00:00<00:00, 28.0kB/s]
Downloading data: 100%|██████████| 231M/231M [00:10<00:00, 22.5MB/s]
Generating train split: 100%|██████████| 785741/785741 [00:13<00:00, 58725.81 examples/s]

DatasetDict({
    train: Dataset({
        features: ['job_title_short', 'job_title', 'job_location', 'job_via', 'job_schedule_type', 'job_work_from_home', 'search_location', 'job_posted_date', 'job_no_degree_mention', 'job_health_insurance', 'job_country', 'salary_rate', 'salary_year_avg', 'salary_hour_avg', 'company_name', 'job_skills', 'job_type_skills'],
        num_rows: 785741
    })
})

In [4]:
dataset = load_dataset('lukebarousse/data_jobs')

In [5]:
df = dataset['train'].to_pandas()

In [6]:
# Cleaning data
df.job_posted_date = pd.to_datetime(df.job_posted_date)

In [ ]:
df.info()

In [16]:
df.iloc[0:5,0:2]

        job_title_short                                          job_title
0  Senior Data Engineer  Senior Clinical Data Engineer / Principal Clin...
1          Data Analyst                                       Data Analyst
2         Data Engineer  Data Engineer/Scientist/Analyst, Mid or Senior...
3         Data Engineer  LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...
4         Data Engineer                             Data Engineer- Sr Jobs

In [19]:
df.loc[:,'salary_rate':'salary_hour_avg'].dropna(subset='salary_rate')

       salary_rate  salary_year_avg  salary_hour_avg
28            year         109500.0              NaN
43            hour              NaN             97.5
51            hour              NaN             72.5
77            year         140000.0              NaN
92            year         120000.0              NaN
...            ...              ...              ...
785624        year         139216.0              NaN
785641        year         150000.0              NaN
785648        year         221875.0              NaN
785682        year         157500.0              NaN
785692        year         157500.0              NaN

[33067 rows x 3 columns]

In [32]:
df.iloc[0:5,-3:]

,company_name,job_skills,job_type_skills
0,Boehringer Ingelheim,None,None
1,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."

In [33]:
df.loc[0:5,'salary_rate':'salary_hour_avg']

  salary_rate  salary_year_avg  salary_hour_avg
0        None         115000.0            45.98
1        None         115000.0            45.98
2        None         115000.0            45.98
3        None         115000.0            45.98
4        None         115000.0            45.98
5        None         115000.0            45.98

In [27]:
# Replace NaN with mean()
median_salary_year_avg = df.salary_year_avg.median()
median_salary_hour_avg = df.salary_hour_avg.median()

In [28]:
df_update = df

In [30]:
df_update.salary_year_avg = df_update.salary_year_avg.fillna(median_salary_year_avg)
df_update.salary_hour_avg = df_update.salary_hour_avg.fillna(median_salary_hour_avg)

In [34]:
df_unique = df_update

In [38]:
df_unique = df_unique.drop_duplicates()

print('Length of the original data frame:        ',len(df_update))
print('Length of the dropped duplicates df:      ',len(df_unique))
print('Rows dropped:        ', len(df_update)-len(df_unique))

Length of the original data frame:         785741
Length of the dropped duplicates df:       785640
Rows dropped:         101

In [39]:
# Drop duplicates in job title from the same company
df_unique = df_unique.drop_duplicates(subset = ['job_title','company_name'])
print('Length of the original data frame:        ',len(df_update))
print('Length of the dropped duplicates df:      ',len(df_unique))
print('Rows dropped:        ', len(df_update)-len(df_unique))

Length of the original data frame:         785741
Length of the dropped duplicates df:       508042
Rows dropped:         277699